{"class_name": "Sequential", "keras_version": "2.0.8", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"name": "conv2d_1", "batch_input_shape": [null, 64, 64, 3], "kernel_size": [5, 5], "kernel_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "trainable": true, "dtype": "float32", "kernel_constraint": null, "strides": [2, 2], "activation": "linear", "bias_regularizer": null, "filters": 32, "bias_constraint": null, "padding": "same", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activity_regularizer": null}}, {"class_name": "ELU", "config": {"name": "elu_1", "alpha": 1.0, "trainable": true}}, {"class_name": "Conv2D", "config": {"name": "conv2d_2", "kernel_size": [3, 3], "filters": 16, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "trainable": true, "kernel_constraint": null, "strides": [1, 1], "activation": "linear", "activity_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "padding": "valid", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "bias_regularizer": null}}, {"class_name": "ELU", "config": {"name": "elu_2", "alpha": 1.0, "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "rate": 0.4, "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last", "padding": "valid", "trainable": true}}, {"class_name": "Conv2D", "config": {"name": "conv2d_3", "kernel_size": [3, 3], "filters": 16, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "trainable": true, "kernel_constraint": null, "strides": [1, 1], "activation": "linear", "activity_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "padding": "valid", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "bias_regularizer": null}}, {"class_name": "ELU", "config": {"name": "elu_3", "alpha": 1.0, "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "rate": 0.4, "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "units": 1024, "kernel_constraint": null, "activation": "linear", "bias_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "rate": 0.3, "trainable": true}}, {"class_name": "ELU", "config": {"name": "elu_4", "alpha": 1.0, "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "units": 512, "kernel_constraint": null, "activation": "linear", "bias_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null}}, {"class_name": "ELU", "config": {"name": "elu_5", "alpha": 1.0, "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "units": 1, "kernel_constraint": null, "activation": "linear", "bias_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null}}]}